In [1]:
import pandas as pd
import numpy as np

In [2]:
names = {"Name":["Angela","Oscar","Kevin","Erin"],
         "Sport":["Jogging","Basketball","Swimming","Jogging"],
        "Cal":[100,200,400,200]}

In [3]:
dataFrame1=pd.DataFrame(names,index=[0,1,2,3])

In [4]:
dataFrame1

     Name       Sport  Cal
0  Angela     Jogging  100
1   Oscar  Basketball  200
2   Kevin    Swimming  400
3    Erin     Jogging  200

In [5]:
names2={"Name":["Pam","Jim","Andy","Micheal"],
         "Sport":["Swimming","Swimming","Jogging","Basketball"],
        "Cal":[300,100,200,500]}

In [6]:
dataFrame2=pd.DataFrame(names2,index=[4,5,6,7])

In [7]:
dataFrame2

      Name       Sport  Cal
4      Pam    Swimming  300
5      Jim    Swimming  100
6     Andy     Jogging  200
7  Micheal  Basketball  500

In [8]:
names3={"Name":["Kelly","Toby","Ryan","Dwight"],
         "Sport":["Jogging","Jogging","Swimming","Basketball"],
        "Cal":[200,100,400,300]}

In [9]:
dataFrame3=pd.DataFrame(names3,index=[8,9,10,11])

In [10]:
dataFrame3

      Name       Sport  Cal
8    Kelly     Jogging  200
9     Toby     Jogging  100
10    Ryan    Swimming  400
11  Dwight  Basketball  300

## concatenation

In [11]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)
#row concat
#if axis=1, column concat

       Name       Sport  Cal
0    Angela     Jogging  100
1     Oscar  Basketball  200
2     Kevin    Swimming  400
3      Erin     Jogging  200
4       Pam    Swimming  300
5       Jim    Swimming  100
6      Andy     Jogging  200
7   Micheal  Basketball  500
8     Kelly     Jogging  200
9      Toby     Jogging  100
10     Ryan    Swimming  400
11   Dwight  Basketball  300

## merge

In [12]:
sportDict = {"Name":["Angela","Oscar","Kevin","Erin"],
         "Sport":["Jogging","Basketball","Swimming","Jogging"]}

In [13]:
calDict = {"Name":["Angela","Oscar","Kevin","Erin"],
        "Cal":[100,200,400,200]}

In [14]:
mergeDataFrame1=pd.DataFrame(sportDict)

In [15]:
mergeDataFrame1

     Name       Sport
0  Angela     Jogging
1   Oscar  Basketball
2   Kevin    Swimming
3    Erin     Jogging

In [16]:
mergeDataFrame2=pd.DataFrame(calDict)

In [17]:
mergeDataFrame2

     Name  Cal
0  Angela  100
1   Oscar  200
2   Kevin  400
3    Erin  200

In [18]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Name")
#on--> describes which column to merge

     Name       Sport  Cal
0  Angela     Jogging  100
1   Oscar  Basketball  200
2   Kevin    Swimming  400
3    Erin     Jogging  200

In [19]:
salaryDict={"Department":["Software","Sales","Sales","Finance","Finance","Human Res"],
        "Employee":["Micheal","Dwight","Jim","Kevin","Oscar","Toby"],
        "Salary":[1000,800,900,500,600,700]}

In [20]:
salaryDataFrame=pd.DataFrame(salaryDict)

In [21]:
salaryDataFrame

  Department Employee  Salary
0   Software  Micheal    1000
1      Sales   Dwight     800
2      Sales      Jim     900
3    Finance    Kevin     500
4    Finance    Oscar     600
5  Human Res     Toby     700

In [22]:
salaryDataFrame["Department"].unique()
#returns unique values

array(['Software', 'Sales', 'Finance', 'Human Res'], dtype=object)

In [23]:
salaryDataFrame["Department"].nunique()
#returns number of unique values

4

In [24]:
salaryDataFrame["Department"].value_counts()
#returns the number of employees in "departments"

Sales        2
Finance      2
Software     1
Human Res    1
Name: Department, dtype: int64

In [25]:
def getPerOfSalary(salary):
    return salary*0.66

In [26]:
salaryDataFrame["Salary"].apply(getPerOfSalary)
#apply method can be used with a function

0    660.0
1    528.0
2    594.0
3    330.0
4    396.0
5    462.0
Name: Salary, dtype: float64

In [27]:
salaryDataFrame.isnull()
#is there any null value? no

   Department  Employee  Salary
0       False     False   False
1       False     False   False
2       False     False   False
3       False     False   False
4       False     False   False
5       False     False   False

In [28]:
newDict={"Serie":["The Office","The Office","Friends","Friends"],
        "Name":["Jim","Andy","Chandler","Monica"],
        "Age":[30,35,36,34]}

In [29]:
charDP=pd.DataFrame(newDict)

In [30]:
charDP

        Serie      Name  Age
0  The Office       Jim   30
1  The Office      Andy   35
2     Friends  Chandler   36
3     Friends    Monica   34

In [31]:
charDP.pivot_table(values="Age",index=["Serie","Name"])

                     Age
Serie      Name
Friends    Chandler   36
           Monica     34
The Office Andy       35
           Jim        30

In [38]:
stock={"Product":["Electronics","Kitchen","Electronics","Kitchen","Electronics"],
      "Name":["Phone","Fridge","Computer","Oven","Phone"],
      "Count":[5,8,10,6,30]}

In [39]:
stockDP=pd.DataFrame(stock)

In [40]:
stockDP

       Product      Name  Count
0  Electronics     Phone      5
1      Kitchen    Fridge      8
2  Electronics  Computer     10
3      Kitchen      Oven      6
4  Electronics     Phone     30

In [43]:
stockDP.pivot_table(values="Count",index=["Product","Name"],aggfunc=np.sum)
#"aggfunc" parameter allows to specify what happens to the "count"values
#in this example, "count" attribute of the variables with the same "name" will be summed
#default: returns mean

                      Count
Product     Name
Electronics Computer     10
            Phone        35
Kitchen     Fridge        8
            Oven          6